basic/controllers/ProductosController.php

    public function actionIndex()
    {
        $searchModel = new ProductosBusqueda();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $query = Productos::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);

        $countries = $query->orderBy('nombre')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `productos`
SELECT * FROM `productos` ORDER BY `nombre` LIMIT 5