basic/views/productos/_form.php


    <?= $form->field($model, 'imagenproducto')->fileInput() ?>

    <?= $form->field($model, 'idcategoria')->listBox(\yii\helpers\ArrayHelper::map(app\models\Categorias::find()->all(),'idcategoria','nombre') ,['multiple' => false]) ?>
---
SELECT * FROM `categorias`